app/controllers/users_controller.rb

INSERT INTO "users" ("name_first", "name_last", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create #Create user and go to question page
    newUser = User.new
    newUser.email = params[:email]
    newUser.password = params[:password]
    newUser.name_first = params[:name_first]
    newUser.name_last = params[:name_last]
    newUser.hometown = params[:hometown]
    newUser.save